# How to create python pandas DataFrame

In [3]:
import pandas as pd

In [5]:
emt = pd.DataFrame()
print(emt)

Empty DataFrame
Columns: []
Index: []

In [6]:
list1 = ['a','b','c']
list1

['a', 'b', 'c']

In [7]:
df1= pd.DataFrame(list1)

In [8]:
df1

   0
0  a
1  b
2  c

In [9]:
list2 = ([1,2,3,4],[10,20,30,40])

In [10]:
demo =pd.DataFrame(list2)

In [11]:
demo

    0   1   2   3
0   1   2   3   4
1  10  20  30  40

In [12]:
df1=pd.DataFrame({'Name':['akshay','manali','aditi'],'Marks':[88,99,89]})
df1

     Name  Marks
0  akshay     88
1  manali     99
2   aditi     89

In [18]:
df1=({'a':10,'b':20},{'a':40 ,'b': 50,'c':30})
df1

({'a': 10, 'b': 20}, {'a': 40, 'b': 50, 'c': 30})

In [20]:
df = pd.DataFrame(df1)

In [21]:
df

    a   b     c
0  10  20   NaN
1  40  50  30.0